In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
list=[91,24,13,1,32]
array=np.array([12,32,45,56,98])
dict={"i":23,"j":34,"k":43,"l":91,"m":87}

In [3]:
pd.Series(data=list)

0    91
1    24
2    13
3     1
4    32
dtype: int64

In [4]:
pd.Series(array)

0    12
1    32
2    45
3    56
4    98
dtype: int32

In [5]:
pd.Series(dict)

i    23
j    34
k    43
l    91
m    87
dtype: int64

In [6]:
pd.Series(data=list,index=array)

12    91
32    24
45    13
56     1
98    32
dtype: int64

In [7]:
s1=pd.Series([23,12,45,36],index=["football","basketball","tennis","volleyball"])
s1

football      23
basketball    12
tennis        45
volleyball    36
dtype: int64

In [8]:
s2=pd.Series([3,17,57,7],index=["cricket","basketball","tennis","volleyball"])
s2

cricket        3
basketball    17
tennis        57
volleyball     7
dtype: int64

In [9]:
s1+s2

basketball     29.0
cricket         NaN
football        NaN
tennis        102.0
volleyball     43.0
dtype: float64

## Data Frame

In [10]:
df=pd.DataFrame([list,array])
df

    0   1   2   3   4
0  91  24  13   1  32
1  12  32  45  56  98

In [11]:
d1={"Id":[101,103,104,110],"Name":["abc","bcd","xyz","ijk"],"Profit":[23,13,45,34]}
df1=pd.DataFrame(d1)
df1

    Id Name  Profit
0  101  abc      23
1  103  bcd      13
2  104  xyz      45
3  110  ijk      34

In [12]:
df1["Id"]

0    101
1    103
2    104
3    110
Name: Id, dtype: int64

In [13]:
df1[["Id","Profit"]]

    Id  Profit
0  101      23
1  103      13
2  104      45
3  110      34

In [14]:
df1.drop("Name",axis=1)

    Id  Profit
0  101      23
1  103      13
2  104      45
3  110      34

In [15]:
df1.drop(["Name","Id"],axis=1)

   Profit
0      23
1      13
2      45
3      34

In [16]:
df1.drop(2)

    Id Name  Profit
0  101  abc      23
1  103  bcd      13
3  110  ijk      34

In [17]:
df2=pd.DataFrame(np.random.randn(7,5),index="A B C D E F G".split(),columns="points1 points2 points3 points4 points5".split())
df2

    points1   points2   points3   points4   points5
A  0.364428 -0.395320  1.157032 -0.064087  0.759813
B  0.956994 -1.397231  0.972660 -0.483799  0.286928
C  1.209695 -0.035066  0.741779  0.562188  0.835678
D -0.208889  0.921516  0.938958  0.039089  0.086717
E  0.360898  0.521209  0.520631  0.017110 -0.059896
F  1.629328  1.507998 -1.517113  1.110542  1.338859
G  0.458971 -0.844620 -0.800939  0.887844  1.339918

In [18]:
df2["points1"]

A    0.364428
B    0.956994
C    1.209695
D   -0.208889
E    0.360898
F    1.629328
G    0.458971
Name: points1, dtype: float64

In [19]:
df2[["points1","points2"]]

    points1   points2
A  0.364428 -0.395320
B  0.956994 -1.397231
C  1.209695 -0.035066
D -0.208889  0.921516
E  0.360898  0.521209
F  1.629328  1.507998
G  0.458971 -0.844620

In [20]:
df2["points6"]=df2["points1"]+df2["points4"]
df2

    points1   points2   points3   points4   points5   points6
A  0.364428 -0.395320  1.157032 -0.064087  0.759813  0.300341
B  0.956994 -1.397231  0.972660 -0.483799  0.286928  0.473195
C  1.209695 -0.035066  0.741779  0.562188  0.835678  1.771882
D -0.208889  0.921516  0.938958  0.039089  0.086717 -0.169800
E  0.360898  0.521209  0.520631  0.017110 -0.059896  0.378008
F  1.629328  1.507998 -1.517113  1.110542  1.338859  2.739870
G  0.458971 -0.844620 -0.800939  0.887844  1.339918  1.346816